20210509101246-programming_language.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-06-08 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Programming Language</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Ultra&display=swap" rel="stylesheet"><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">Programming Language</h1>
<div id="outline-container-org0d4e4ca" class="outline-2">
<h2 id="org0d4e4ca"><a href="#org0d4e4ca">概要</a></h2>
<div class="outline-text-2" id="text-org0d4e4ca">
<p>
プログラミング言語は、コンピュータへの命令を記述する言語。
</p>
</div>
</div>
<div id="outline-container-orgcc445ee" class="outline-2">
<h2 id="orgcc445ee"><a href="#orgcc445ee">Memo</a></h2>
<div class="outline-text-2" id="text-orgcc445ee">
</div>
<div id="outline-container-org4e09cb2" class="outline-3">
<h3 id="org4e09cb2"><a href="#org4e09cb2">上達とブログ</a></h3>
<div class="outline-text-3" id="text-org4e09cb2">
<p>
プログラミング上達にはブログを書くことが重要だという。
学んだことをそのまま書くのではなくて、自分でコードを用意して書くこと。
</p>
</div>
</div>
<div id="outline-container-org8bdb981" class="outline-3">
<h3 id="org8bdb981"><a href="#org8bdb981">背景理解</a></h3>
<div class="outline-text-3" id="text-org8bdb981">
<p>
問題解決するだけでは応用性という点で十分でない。
やっていることを完全理解するために調べたり書く。次の似たような問題が対応できるようになる。
毎回ちょっと違うことをググることになるなら、理解できてない。
</p>
</div>
</div>
<div id="outline-container-org2d0e1fe" class="outline-3">
<h3 id="org2d0e1fe"><a href="#org2d0e1fe">言語の学びやすさ</a></h3>
<div class="outline-text-3" id="text-org2d0e1fe">
<p>
言語そのものより、既存のプロジェクトがどれくらいあるか、も大きい。
難しくても、参考になるコードが簡単に見つけられれば学習は容易になる。
</p>

<p>
また、使い慣れたソフトがあるなら最高。何をするのか予めわかっていればすぐ理解できる。
本体コードを見るのもいい。
</p>
</div>
</div>
<div id="outline-container-org8b2a78e" class="outline-3">
<h3 id="org8b2a78e"><a href="#org8b2a78e"><a href="https://tatsu-zine.com/books/clean-architecture">Clean Architecture 達人に学ぶソフトウェアの構造と設計</a></a></h3>
<div class="outline-text-3" id="text-org8b2a78e">
<ul class="org-ul">
<li>121,134,152,168,185, 235</li>
<li>コードをどう組み合わせるか。アーキテクチャに関する本</li>
<li>構造化、関数型、オブジェクト指向…プログラミングパラダイムは、どれも制限を課すものである</li>
<li>オブジェクト指向の最も有益な特徴はポリモーフィズムである。ソースコードの依存関係を実行順序と関係なくできる。ビジネスロジックが最上位にあり、下位にライブラリやデータベースを置き、これらは交換可能である。実行順序とは逆だ</li>
<li>プラグインアーキテクチャは、上位レベルの方針を含んだモジュールを下位レベルの詳細を含んだモジュールから独立させること。下位レベルの詳細はプラグインモジュールとなり、上位レベルの方針を含んだモジュールとは独立して、デプロイおよび開発することが可能となる</li>
<li>単一責任原則(SRP)の失敗例: Employeeクラスに、経理、人事部門、データベース管理者の3つの部門の責務が入っているようなとき。
<ul class="org-ul">
<li>つまり、アクターの異なるコードは分割すべきということ</li>
</ul></li>
<li>オープン・クローズドの原則(OCP): ソフトウェアの振る舞いは、既存の成果物を変更せず拡張できるようにすべきである。
<ul class="org-ul">
<li>ローグライクチュートリアルがまさにそんな感じだった。機能追加で既存の箇所をいじる必要はなく、独立している</li>
<li>ちょっとした拡張のために大量の書き換えが必要になるようなら、そのソフトウェアシステムのアーキテクトは大失敗への道を突き進んでいる</li>
</ul></li>
<li>依存性逆転の法則: ソースコードは具象に依存するべきではない。変化しやすい具象クラスを参照しない、継承しない。重要な部分が、重要でない部分に依存しないように設計すべき</li>
<li>再利用・リリース等価の原則: 同じタイミングで変更されることが多いクラスはひとつにまとめる</li>
<li>閉鎖性共通の原則: 同じ理由、同じタイミングで変更されるクラスをコンポーネントにまとめること。変更の理由やタイミングが異なるクラスは、別のコンポーネントに分けること</li>
<li>全再利用の原則: コンポーネントのユーザに対して、実際には使わないものへの依存を強要してはいけない</li>
<li>安定依存の原則: 安定度の高い方向に依存する</li>
<li>安定度・抽象度等価の原則: コンポーネントの抽象度は、その安定度と同程度でなければならない。安定度の高いコンポーネントは抽象度も高くあるべき</li>
<li>優れたアーキテクトは、方針と詳細を慎重に区別して、方針が詳細を把握することなく、決して依存することがないように、両者を切り離す</li>
<li>アーキテクチャがサポートしなければいけないこと:
<ul class="org-ul">
<li>システムのユースケース</li>
<li>システムの運用</li>
<li>システムの開発</li>
<li>システムのデプロイ</li>
</ul></li>
<li>注文入力システムに注文を追加するユースケースは、注文を削除するユースケースと比べると、明らかに異なる頻度と理由で変更される</li>
<li>優れたアーキテクトは、システムの詳細の決定を従属的かつ遅延可能なものにする</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0fd7d2a" class="outline-2">
<h2 id="org0fd7d2a"><a href="#org0fd7d2a">Tasks</a></h2>
<div class="outline-text-2" id="text-org0fd7d2a">
</div>
<div id="outline-container-org489c892" class="outline-3">
<h3 id="org489c892"><a href="#org489c892"><span class="todo TODO">TODO</span> <a href="http://craftinginterpreters.com/">Crafting Interpreters</a></a></h3>
<div class="outline-text-3" id="text-org489c892">
<p>
インタプリタを実装する。
</p>
</div>
</div>
<div id="outline-container-orgc0e5bdb" class="outline-3">
<h3 id="orgc0e5bdb"><a href="#orgc0e5bdb"><span class="todo TODO">TODO</span> <a href="https://www.amazon.co.jp/-/en/Steve-McConnell-ebook/dp/B01E5DYK1C/ref=sr_1_1?keywords=code+complete&amp;qid=1650678654&amp;sprefix=%2Caps%2C158&amp;sr=8-1">Code Complete 第2版 完全なプログラミングを目指して</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Read">Read</span></span></a></h3>
<div class="outline-text-3" id="text-orgc0e5bdb">
</div>
<div id="outline-container-org25d140d" class="outline-4">
<h4 id="org25d140d"><a href="#org25d140d"><span class="done DONE">DONE</span> 10%</a></h4>
<div class="outline-text-4" id="text-org25d140d">
</div>
</div>
<div id="outline-container-orgc677e89" class="outline-4">
<h4 id="orgc677e89"><a href="#orgc677e89"><span class="done DONE">DONE</span> 20%</a></h4>
<div class="outline-text-4" id="text-orgc677e89">
<p>
設計。
コードが書けるレベルに具体化するまで行う。
設計をレビューしてくれる人がいない場合は一週間放置して見返してみる。
自分の設計を理解するのが難しく感じたのなら、自分以外の人が理解するのはもっと難しい。
トップダウン、ボトムアップを併用する。
トップダウンは最初簡単だが、あとの複雑さに気づかないことがある。
ボトムアップは最初難しいが、複雑さを早い段階で明らかにできる可能性がある。
最初に思いついた設計は間違っている。
</p>

<p>
クラス。
クラスがどのような抽象化を実装しているのか理解する。
できるだけ実装を隠し単純化する。
</p>
</div>
</div>
<div id="outline-container-orge99cec0" class="outline-4">
<h4 id="orge99cec0"><a href="#orge99cec0">30%</a></h4>
</div>
<div id="outline-container-org47f0487" class="outline-4">
<h4 id="org47f0487"><a href="#org47f0487">40%</a></h4>
</div>
<div id="outline-container-orgd5093c9" class="outline-4">
<h4 id="orgd5093c9"><a href="#orgd5093c9">50%</a></h4>
</div>
<div id="outline-container-orgb30c116" class="outline-4">
<h4 id="orgb30c116"><a href="#orgb30c116">60%</a></h4>
</div>
<div id="outline-container-orgc7e7716" class="outline-4">
<h4 id="orgc7e7716"><a href="#orgc7e7716">70%</a></h4>
</div>
<div id="outline-container-org2f1c51b" class="outline-4">
<h4 id="org2f1c51b"><a href="#org2f1c51b">80%</a></h4>
</div>
<div id="outline-container-orga1f295c" class="outline-4">
<h4 id="orga1f295c"><a href="#orga1f295c">90%</a></h4>
</div>
<div id="outline-container-orgf865c56" class="outline-4">
<h4 id="orgf865c56"><a href="#orgf865c56">100%</a></h4>
</div>
</div>
</div>
<div id="outline-container-orga92a03e" class="outline-2">
<h2 id="orga92a03e"><a href="#orga92a03e">References</a></h2>
<div class="outline-text-2" id="text-orga92a03e">
</div>
<div id="outline-container-org3aebd37" class="outline-3">
<h3 id="org3aebd37"><a href="#org3aebd37"><a href="https://www.oreilly.com/library/view/domain-specific-languages/9780132107549/">Domain Specific Languages Book</a></a></h3>
<div class="outline-text-3" id="text-org3aebd37">
<p>
DSLの本。
よくあるテクニックがどういう仕組みで動いているか解説。
</p>
</div>
</div>
<div id="outline-container-org1cc6065" class="outline-3">
<h3 id="org1cc6065"><a href="#org1cc6065"><a href="https://web.archive.org/web/20140416021831/http:/lists.canonical.org/pipermail/kragen-tol/2011-August/000937.html">Goodbye, shitty Car extends Vehicle object-orientation tutorial</a></a></h3>
<div class="outline-text-3" id="text-org1cc6065">
<p>
オブジェクト指向に対する、理解しやすいが間違った説明の議論。
</p>
</div>
</div>
<div id="outline-container-org056895a" class="outline-3">
<h3 id="org056895a"><a href="#org056895a"><a href="https://github.com/sdmg15/Best-websites-a-programmer-should-visit">sdmg15/Best-websites-a-programmer-should-visit: Some useful websites for programmers.</a></a></h3>
<div class="outline-text-3" id="text-org056895a">
<p>
役立つリンク集。
</p>
</div>
</div>
<div id="outline-container-orgc8a0eed" class="outline-3">
<h3 id="orgc8a0eed"><a href="#orgc8a0eed"><span class="todo TODO">TODO</span> <a href="https://github.com/donnemartin/system-design-primer">donnemartin/system-design-primer: Learn how to design large-scale systems. Prep for the system design interview. Includes Anki flashcards.</a></a></h3>
<div class="outline-text-3" id="text-orgc8a0eed">
<p>
大きなシステムの設計方法を学ぶ方法。
</p>
</div>
</div>
<div id="outline-container-org217f065" class="outline-3">
<h3 id="org217f065"><a href="#org217f065"><span class="todo TODO">TODO</span> <a href="https://github.com/kamranahmedse/design-patterns-for-humans">kamranahmedse/design-patterns-for-humans: An ultra-simplified explanation to design patterns</a></a></h3>
<div class="outline-text-3" id="text-org217f065">
<p>
シンプルなデザインパターンの解説。
</p>
</div>
</div>
<div id="outline-container-org96685cc" class="outline-3">
<h3 id="org96685cc"><a href="#org96685cc"><span class="todo TODO">TODO</span> <a href="https://github.com/mtdvio/every-programmer-should-know">mtdvio/every-programmer-should-know: A collection of (mostly) technical things every software developer should know about</a></a></h3>
<div class="outline-text-3" id="text-org96685cc">
<p>
プログラマーが知るべきこと。
</p>
</div>
</div>
<div id="outline-container-org725e174" class="outline-3">
<h3 id="org725e174"><a href="#org725e174"><span class="todo TODO">TODO</span> <a href="https://web.archive.org/web/20120530181801/http:/local.joelonsoftware.com:80/wiki/Japanese">Japanese - The Joel on Software Translation Project</a></a></h3>
<div class="outline-text-3" id="text-org725e174">
<p>
エッセイの日本語訳。
</p>
</div>
</div>
<div id="outline-container-org8cd722d" class="outline-3">
<h3 id="org8cd722d"><a href="#org8cd722d"><span class="todo TODO">TODO</span> <a href="https://www.infoq.com/jp/articles/Understanding-Monads-guide-for-perplexed/">モナドを理解する - 迷える者への手引き</a></a></h3>
<div class="outline-text-3" id="text-org8cd722d">
<p>
モナドの解説。
</p>
</div>
</div>
<div id="outline-container-org30d4e30" class="outline-3">
<h3 id="org30d4e30"><a href="#org30d4e30"><a href="https://qiita.com/hirokidaichi/items/27c757d92b6915e8ecf7">ペアプログラミングして気がついた新人プログラマの成長を阻害する悪習 - Qiita</a></a></h3>
</div>
<div id="outline-container-org97bffd8" class="outline-3">
<h3 id="org97bffd8"><a href="#org97bffd8"><a href="https://diveintocode.jp/blogs/Technology/PryDebug">DIVE INTO CODE | エラーの原因を突き止めるためにデバッグをする</a></a></h3>
<div class="outline-text-3" id="text-org97bffd8">
<p>
pryデバッグの方法。
</p>
</div>
</div>
<div id="outline-container-org6f0cb13" class="outline-3">
<h3 id="org6f0cb13"><a href="#org6f0cb13"><a href="http://helloworldcollection.de/">The Hello World Collection</a></a></h3>
<div class="outline-text-3" id="text-org6f0cb13">
<p>
あらゆるプログラミング言語のhello world集。
</p>
</div>
</div>
<div id="outline-container-org2ee79c5" class="outline-3">
<h3 id="org2ee79c5"><a href="#org2ee79c5"><a href="https://gamesfromwithin.com/data-oriented-design">Data-Oriented Design (Or Why You Might Be Shooting Yourself in The Foot With OOP) – Games from Within</a></a></h3>
<div class="outline-text-3" id="text-org2ee79c5">
<p>
データ指向のデザイン。
</p>
</div>
</div>
<div id="outline-container-orga9787f7" class="outline-3">
<h3 id="orga9787f7"><a href="#orga9787f7"><span class="todo TODO">TODO</span> <a href="https://practical.engineering/">Practical Engineering</a></a></h3>
<div class="outline-text-3" id="text-orga9787f7">
<p>
エンジニアリングに関する面白い記事がある。
</p>
</div>
</div>
<div id="outline-container-orge749dea" class="outline-3">
<h3 id="orge749dea"><a href="#orge749dea"><a href="https://www.digitalocean.com/community/conceptual_articles/s-o-l-i-d-the-first-five-principles-of-object-oriented-design">SOLID: The First 5 Principles of Object Oriented Design | DigitalOcean</a></a></h3>
<div class="outline-text-3" id="text-orge749dea">
<p>
オブジェクト指向の原則。
</p>
</div>
</div>
<div id="outline-container-orgfe4d535" class="outline-3">
<h3 id="orgfe4d535"><a href="#orgfe4d535"><a href="https://xn--97-273ae6a4irb6e2hsoiozc2g4b8082p.com/">プログラマが知るべき97のこと</a></a></h3>
</div>
<div id="outline-container-orge71d806" class="outline-3">
<h3 id="orge71d806"><a href="#orge71d806"><a href="https://xn--97-273ae6a4irb6e2hxjpb5etb3nqtgfpmg22065a.com/">ゲームクリエイターが知るべき97のこと</a></a></h3>
</div>
<div id="outline-container-org20bd9be" class="outline-3">
<h3 id="org20bd9be"><a href="#org20bd9be"><a href="https://www.pygame.org/tags/all">Pygameリンク集</a></a></h3>
</div>
<div id="outline-container-org07867c1" class="outline-3">
<h3 id="org07867c1"><a href="#org07867c1"><a href="https://gameprogrammingpatterns.com/contents.html">Table of Contents · Game Programming Patterns</a></a></h3>
<div class="outline-text-3" id="text-org07867c1">
<p>
ゲームプログラミングでよく使われるデザインパターン。
</p>
</div>
</div>
</div>
<div id="outline-container-org26d9398" class="outline-2">
<h2 id="org26d9398"><a href="#org26d9398">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
